#include "iwgd.h"

/******************************************************************************/
/*                                看门狗初始化                                */
/*                               prer:分频数:0~7                              */
/*                          rlr:自动重装载值,0~0XFFF.                         */
/*                      时间计算:Tout=((4*2^prer)*rlr)/32 (ms).               */
/******************************************************************************/

void IWDG_Init(u8 prer,u16 rlr)
{
	IWDG_WriteAccessCmd(IWDG_WriteAccess_Enable);//使能对IWDG->PR IWDG->RLR的写
	IWDG_SetPrescaler(prer);//设置IWDG分频系数
	IWDG_SetReload(rlr);//设置IWDG装载值
	IWDG_ReloadCounter();//reload
	IWDG_Enable();//使能看门狗
}

/******************************************************************************/
/*                                   喂狗                                     */
/******************************************************************************/

void IWDG_Feed(void)
{
	IWDG_ReloadCounter();//reload
}

/******************************************************************************/
/*                          利用看门狗完成系统重启                            */
/******************************************************************************/

void sys_restart(void)
{
	IWDG_Init(1,10);
	while(1);
}
